---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WorksharingUtils..::..CheckoutWorksets Method
WorksharingUtils Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CheckoutWorksets(Document, ICollection<(Of <<'(WorksetId>)>>)) | Obtains ownership for the current user of as many specified worksets as possible. |
|  | CheckoutWorksets(Document, ISet<(Of <<'(WorksetId>)>>), TransactWithCentralOptions) | Obtains ownership for the current user of as many specified worksets as possible. |

# See Also

WorksharingUtils Class

WorksharingUtils Members

Autodesk.Revit.DB Namespace